Repository: vloch/metnav
Catalog: metnav/i18n/metnav-*.po
Languages: fr

source: box_hasard
fr: Une ressource

source: box_semaine
fr: Ressource de la semaine

source: description_metadata
fr: Vous pouvez configurer dans cette partie tout ce qui concerne les métadonnées utilisées pour indexer vos contenus.

source: description_metnav_general
fr: Vous pouvez configurer dans cette partie les éléments généraux de MetNav.

source: description_prefs_metadata_nav
fr: Vous permet de configurer les propriétés de navigation sur les métadonnées.

source: description_templates_url
fr: Vous pouvez configurer dans cette partie les URL des différents templates d'affichage des données XML.

source: description_xpath
fr: Vous pouvez configurer dans cette partie les requêtes utilisées pour la navigation sur les métadonnées afin de personnaliser les résultats renvoyés.

source: description_xsl
fr: Vous pouvez configurer dans cette partie les chemins des XSL d'affichage ainsi que les options à passer pour la transformation Docbook vers HTML

source: header_prefs_metnav
fr: Configuration de MetNav

source: heading_archives
fr: Archives du site

source: heading_dossier
fr: Dossier

source: heading_news
fr: Nouveautés

source: heading_objects
fr: Types de ressources

source: heading_semaine_index
fr: Ressources de la semaine

source: help_batch_length
fr: Nombre d'éléments affichés par page lors des recherches (nouvelles, archives, dossiers, etc.)

source: help_collections
fr: Indiquez la configuration dans cet ordre: chemin portail|nom de classification|url de classification|collection des métadonnées. <br/> Le chemin / est <b>obligatoire</b>, il indique le chemin par défaut. Le premier chemin répondant au contexte actuel sera utilisé. Attention à l'ordre dans lequel vous les placez.

source: help_condition_base
fr: Un morceau valide de XQuery exprimant une condition qui sera appliquée à toutes les XQueries.

source: help_db_xsl
fr: Chemin vers la XSL DocBook à utiliser pour les transformations. Préciser le type d'URI (file://, xmldb:exist://, etc.). Attention, s'il s'agit d'un type 'file://', c'est la localisation sur la machine qui héberge le serveur eXist qui doit être donnée.

source: help_db_xsl_opts
fr: Options à passer à la XSL DocBook lors de la transformation (voir la documentation de la XSL). Une option par ligne, de la forme: param=value

source: help_default_collation
fr: Formulation XQuery de la collation (langue et règles de langages) utilisée par défaut.

source: help_exist_da
fr: Identifiant du connecteur eXistDA à utiliser pour toutes les connexions à la base. Le connecteur doit se trouver dans portal_skins/custom ou à la racine du site Plone.

source: help_head_sup
fr: Options supplémentaires à placer dans le header des requêtes.

source: help_img_width
fr: Largeur (en pixels) des images lors de l'affichage des métadonnées sous forme de table.

source: help_ld2db_xsl
fr: Chemin vers la XSL LivreDoc vers DocBook à utiliser pour les transformations. Préciser le type d'URI (file://, xmldb:exist://, etc.).

source: help_limit_related
fr: Nombre maximum de documents connexes affichés dans le portlet "Voir aussi".

source: help_nb_row_table
fr: Nombre d'éléments affichés par ligne pour les "objets de la semaine".

source: help_objects
fr: Correspondance des objets et de leurs noms affichés. De la forme nom affiché=nom dans le lom.

source: help_objet_semaine
fr: Un morceau valide de XQuery exprimant une façon de filtrer les types d'objets pour créer une ressource de la semaine.

source: help_score_connexe
fr: Score minimum des documents connexes affichés dans le portlet "Voir aussi".

source: help_template_search
fr: Expression de recherche. Deux %s sont acceptés: le premier est le noeud XML dans lequel chercher, le deuxième est l'expression à rechercher.

source: help_url_doc
fr: Chemin et template pour les documents.

source: help_url_doc_hide
fr: Chemin et template pour les documents qui ne sont pas accessibles aux anonymes.

source: help_url_img
fr: Chemin et template pour les images.

source: help_xpath_search_expr
fr: Variables qui seront utilisées dans les recherches XPath avec leur correspondance XPath. De la forme variable=valeur. Une par ligne.

source: help_xq_fn_url
fr: Chemin vers les fonctions génériques XQuery livrées avec le produit (URL HTTP de préférence, ou bien dans la base eXist).

source: help_xsl_class_list
fr: Chemin vers la XSL qui transforme la classification en liste (portlet thèmes). Préciser le type d'URI (file://, xmldb:exist://, etc.).

source: help_xsl_count
fr: Chemin vers la XSL qui compte le nombre de résultats. Préciser le type d'URI (file://, xmldb:exist://, etc.).

source: help_xsl_dict
fr: Chemin vers la XSL qui transforme le résultat en un dictionnaire Python. Préciser le type d'URI (file://, xmldb:exist://, etc.).

source: help_xsl_page
fr: Chemin vers la XSL qui transforme le résultat en une page Plone. Préciser le type d'URI (file://, xmldb:exist://, etc.).

source: help_xsl_portlet
fr: Chemin vers la XSL qui transforme le résultat en un portlet Plone. Préciser le type d'URI (file://, xmldb:exist://, etc.).

source: help_xsl_rss
fr: Chemin vers la XSL qui transforme le résultat en un flux RSS. Préciser le type d'URI (file://, xmldb:exist://, etc.).

source: help_xsl_table
fr: Chemin vers la XSL qui transforme le résultat en un tableau. Préciser le type d'URI (file://, xmldb:exist://, etc.).

source: help_xsl_year_list
fr: Chemin vers la XSL qui transforme le compte des années des objets de la semaine en liste. Préciser le type d'URI (file://, xmldb:exist://, etc.).

source: label_batch_length
fr: Nombre d'éléments par page

source: label_collections
fr: Configuration des classifications et chemins

source: label_condition_base
fr: Condition de base XQuery

source: label_db_xsl
fr: Chemin vers la XSL DocBook

source: label_db_xsl_opts
fr: Options à passer à la XSL DocBook

source: label_default_collation
fr: Collation par défaut

source: label_exist_da
fr: Identifiant du connecteur eXistDA à utiliser

source: label_head_sup
fr: Options supplémentaires du header

source: label_img_width
fr: Taille des images

source: label_ld2db_xsl
fr: Chemin vers la XSL LivreDoc vers DocBook

source: label_limit_related
fr: Nombre maximums de documents connexes

source: label_nb_row_table
fr: Nombre d'éléments par ligne pour les "objets de la semaine"

source: label_objects
fr: Types de ressources

source: label_objet_semaine
fr: Définition d'un type "ressource de la semaine"

source: label_score_connexe
fr: Score minimum de documents connexes

source: label_template_search
fr: Expression de recherche par défaut

source: label_url_doc
fr: Chemin et template pour les documents

source: label_url_doc_hide
fr: Chemin et template pour les documents protégés

source: label_url_img
fr: Chemin et template pour les images

source: label_xpath_search_expr
fr: Variables pour les recherches XPath

source: label_xq_fn_url
fr: Chemin vers les fonctions génériques XQuery

source: label_xsl_class_list
fr: Chemin vers la XSL qui transforme la classification en liste

source: label_xsl_count
fr: Chemin vers la XSL qui compte le nombre de résultats

source: label_xsl_dict
fr: Chemin vers la XSL qui transforme le résultat en un dictionnaire Python

source: label_xsl_page
fr: Chemin vers la XSL qui transforme le résultat en une page Plone

source: label_xsl_portlet
fr: Chemin vers la XSL qui transforme le résultat en un portlet Plone

source: label_xsl_rss
fr: Chemin vers la XSL qui transforme le résultat en un flux RSS

source: label_xsl_table
fr: Chemin vers la XSL qui transforme le résultat en un tableau

source: label_xsl_year_list
fr: Chemin vers la XSL qui transforme le compte des années des objets de la semaine en liste

source: legend_metadata
fr: Métadonnées

source: legend_metnav_general
fr: Configuration générale de MetNav

source: legend_prefs_metadata_nav
fr: Configuration de MetNav

source: legend_templates_url
fr: URL des templates

source: legend_xpath
fr: Modèles XPath

source: legend_xsl
fr: XSL

source: up_a_level
fr: Aller au niveau supérieur

source: xml_select_res
fr: Vous devez choisir une ressource à afficher.
